(function(global){
    "use strict";

    // モジュール設定
    global["pipboy"] = global.pipboy || {};
    var module = global.pipboy;


    /**
     * PIPKerningTable
     *
     * カーニング値を保持するテーブル
     *
     * @type {{}}
     */
    module.PIPKerningTable = function(){

    };
    ////////////////////////////////////////////////
    // Header
    ////////////////////////////////////////////////

    // カーニングテーブル
    // * ワイルドカード
    module.PIPKerningTable.table = {

        // 句読点（前詰め）
        'す。' : -0.1,
        'く。' : -0.1,
        'く、' : -0.1,

        // 句読点（後詰め）
        '、*' : -0.2,
        '。*' : -0.2,

        // 句読点+カッコ
        '。「' : -0.5,
        '、「' : -0.5,
        '」。' : -0.5,
        '」、' : -0.5,

        // カッコ（前後外詰め）
        '*（' : -0.4,
        '）*' : -0.4,
        '*【' : -0.4,
        '】*' : -0.3,

        // かぎカッコ（前後内外詰め）
        '*「' : -0.3,
        '」*' : -0.3,
        '「*' : 0.1,
        '*」' : 0.1,

        // ハイフン（前後詰め）
        '-*' : 0.2,
        '*-' : 0.2,

        // ハイフン全角（前後詰め）
        '―*' : 0.2,
        '*―' : 0.2,

        // スラッシュ（前後詰め）
        '／*' : 0.2,
        '*／' : 0.2,

        // 中黒（前後詰め）
        '・*' : -0.1,
        '*・' : -0.1,

        // ダブルコーテーション（前後詰め）
        '〟*' : -0.4,
        '*〝' : -0.5,

        // ビックリマーク（前後詰め）
        '！*' : -0.2,
        '*！' : -0.2,

        // ひらがな（前後詰め）
        'ちょ' : -0.1,
        'ょっ' : -0.1,
        'んで' : -0.1,
        'えて' : -0.1,
        'して' : -0.1,
        'とう' : -0.1,
        'いく' : -0.1,
        'しく' : -0.1,
        'する' : -0.1,
        'く*' : -0.1,
        'っ*' : -0.1,
        '*っ' : -0.1,

        // カタカナ（前後詰め）
        '*ト' : -0.1,
        '*ド' : -0.1,
        '*ュ' : -0.1,
        '*ャ' : -0.1,
        'ップ' : -0.1,
        'ャレ' : -0.1,
        'ィン' : -0.1,
        'フォ' : -0.1,
        'フリ' : -0.1,
        'ティ' : -0.1,
        'スト' : -0.1,
        'イメ' : -0.1,

        // カタカナ（前後詰め）
        '*：' : -0.1,
        '：*' : -0.1
    };

    // Beginning of Line (行頭)
    module.PIPKerningTable.BOL = {
        '（': -0.5,
        '「': -0.5,
        '〝': -0.5,
        '【': -0.5
    }




})((this || 0).self || global);